{"breakingnews": ["Unclear if German embassy staff killed or hurt in Kabul blast: source", "French embassy in Kabul damaged in car bomb attack: minister", "Kabul blast hurts German embassy staff, kills guard: minister", "France says worried by Ukraine crisis, demands guarantees for observers", "Belgium arrests man in connection with Paris attacks", "Two French citizens injured in London attack: President's office", "Iran says London attacks 'wake up call', urges uprooting terrorism sources", "One Canadian national among those killed in London attack - PM Trudeau", "One French national died in London attack: foreign minister", "China says 31 nationals detained in Zambia for illegal mining", "France says two citizens missing since London attack", "Irish police arrest two men linked to London Bridge attacker", "Terrorist financing at heart of Qatar crisis, says UAE minister", "German minister sees danger in 'Trumpification' of conflict in Gulf", "Germany sees no impact from Gulf crisis on economy, anti-IS coalition", "Qatar condemns attacks in Iran: foreign ministry", "Jordan begins trial of soldier accused of killing three U.S. trainers", "Cameroon court denies bail to Anglophone protesters", "U.S. condemns attacks in Iran: State Dept.", "Head of U.S. missile defense says North Korea missile advances a 'great concern'", "Somalia's al Shabaab kills 20 soldiers in Puntland attack: officer", "Russia rebuffs Poland's criticism it mishandled 2010 air crash bodies", "Iran attackers fought for Islamic State in Syria, Iraq: ministry", "U.S. concerned Iraqi Kurdish referendum will distract from war: State Department", "Turkey says Iraqi Kurdish independence vote a 'terrible mistake'", "Israeli fire kills Palestinian in Gaza stone-throwing clash: Health Ministry", "Thousands mourn Tehran attack victims, chant 'Death to Saudi'", "Afghan policemen killed in U.S. airstrike: officials", "Car hits pedestrians near Amsterdam station in accident, 2 hurt", "Britain, U.S. deny that Trump state visit delayed", "Afghan civilians killed as U.S. troops open fire after bomb attack: Afghan official", "Kuwait emir warns against 'undesirable consequences' in Gulf dispute", "Panama ex-president, accused of political espionage, arrested in Florida", "Policewoman shot in head at Munich station, no terrorist link", "Turkey's Erdogan decries isolation of Qatar as 'inhumane', like a 'death penalty'", "Germany criticizes arrests of Russian demonstrators", "Defence lawyers walk out of top Bahraini activist trial", "Turkish minister lands in Qatar aiming to help ease Gulf rift", "Fire engulfs London tower block, at least 12 dead, dozens injured", "British Conservatives putting Irish peace at risk: Sturgeon", "Qatar says fighter jets deal shows deep U.S. support", "Russia says not 100 percent sure Baghdadi is dead: RIA", "White House has no update on Russian report of Baghdadi's death", "U.S. says has no information Baghdadi killed in Russian strike", "Germany threatens retaliation if U.S. sanctions harm its firms", "One injured sailor evacuated from U.S. Navy destroyer in collision off Japan", "Japan coast guard confirms seven missing after U.S. destroyer collides with container ship", "Saudi guards fire on Iranian boat, killing fisherman: report", "Russian ForMin calls on U.S. to respect Syria's integrity: agencies", "U.S. urges bigger Chinese role to combat global terrorism", "Israeli troops shoot, kill Palestinian who tried to stab them: army", "U.N. chief hopes U.S., Russia calm tensions over Syria", "France music festival goes on despite Brussels attack: spokesman", "Egyptian Christians, Muslims share Ramadan meals despite Islamist violence", "U.S. general condemns Islamic State's destruction of Mosul mosque", "Car bomb kills seven at police station in Somali capital: police", "Colombia's ELN rebels free two Dutch journalists", "Germany condemns Turkish criticism of Berlin's new liberal mosque", "Anger in Mosul as Islamic State destroys historic mosque", "Muslims in Asia pray for peace as Ramadan holy month ends", "Israel attacks Syrian posts after cross-border fire from Syria", "Irish naval ship rescues 712 people near Libya: defense forces", "U.S. to list China among worst human trafficking offenders: sources", "Germany urges all sides in Qatar crisis to talk, avoid escalation", "U.S. brands China as among worst human trafficking offenders", "Revived U.S. travel ban sows confusion, anger in Middle East", "'Last-chance' Cyprus peace talks open in Swiss Alps", "U.S. says its warning appears to have averted Syrian chemical attack", "France urges China to free activist Liu, no comment if ready to welcome him", "Britain hopes Hong Kong makes more progress toward democracy", "Moroccan national suspected of role in protests arrested in Netherlands"]}