{"breakingnews": ["Friendly fire may have killed U.S. troops in Afghanistan: Pentagon", "Vietnamese who died of stroke at Japan detention center left lying for hours: document", "Pakistan extends house arrest of Islamist blamed for Mumbai attack", "Islamic State kills 7 Iraqi soldiers in attacks near Syrian border", "Trump says he's committed to working for Israel-Palestinian peace", "Trump: Israelis, Palestinians appear willing to make peace deal", "Seven Chinese vessels detained off West Africa for illegal fishing", "Back in power, Bulgaria's Borisov promises income boost", "U.S. charges four Chinese nationals in college entrance exam scam", "Pakistani, Afghan troops exchange fire on border, several killed", "China demands Taiwan free injured fishermen", "Islamic State attacks kill two at Iraqi base where U.S. advisers stationed", "Kidnapped Frenchman freed in rescue mission in Sudan's Darfur", "UK's May congratulates Macron on winning French presidency", "11 children, several South Korean, die in bus crash in China", "Germany charges Swedish killer with 25-year-old murder", "Palestinian hunger strike heightens tension with Israel", "China most-wanted suspect gets 'home detention' in New Zealand", "Italy arrests Libyan suspected of involvement in migrant murder", "Pakistan summons Indian diplomat over Kashmir firing death", "Germany's Gabriel says agrees with Turkish PM on need to improve ties", "Venezuelan protesters block embassy center in Madrid", "U.S.-backed Syrian forces await weapons for summer assault on Raqqa", "Jordanian stabs Israeli police officer, shot dead: police", "United States says it supports China's infrastructure connectivity plan", "Australia receptive to China's Silk Road, but national interest first", "Italy rescues migrants as calls mount to secure southern Libya", "Top U.S. Intelligence Democrat blasts Trump over Russia report", "Syrian government denies U.S. accusation of crematorium at prison", "German Holocaust denier arrested in Hungary", "Man arrested over 1984 murder outside Libyan embassy in London is released", "Ukraine president's office accuses Russia of attack on presidential website", "Jordanian official denies reports of Syria camp bomb", "U.S. extends sanctions relief under Iran nuclear deal", "China's top diplomat says hopes South Korea can resolve THAAD issue", "U.S. senator insists special counsel won't derail Congress' Russia probes", "France says Rouhani re-election strengthens hope of Iran nuclear deal application", "Mexican mob attacks Russian man in Cancun over insults", "Cairo lantern-maker champions old craft against Chinese imports", "North Korea tests another missile; Seoul says dashes hopes for peace", "North Korea appears to have won meaningful data from recent missile test: South Korea", "China detains six Japanese on suspicion of 'illegal activities'", "Suicide bomber suspected in Manchester blast: two U.S. officials", "North Korea says missile ready for mass production, U.S. questions progress", "Hong Kong graft arrests add to China-Hong Kong bridge woes", "Trump says Palestinian and Israeli leaders ready to \"reach for peace\"", "Iran condemns UK attack, criticizes Western security ties to Gulf", "Polish couple died in Manchester attack: foreign minister", "France extends emergency powers after Manchester attack", "After Maryland student's speech, mockery and anger in China", "France's Macron seeks extended emergency powers after Manchester attack", "China says no one should bring chaos to Korean peninsula", "Melania factor boosts tourism in Slovenia", "Leaks of Manchester bomb probe 'reprehensible,' will stop: U.S. envoy", "UK PM May says intelligence sharing partnership with U.S. based on trust", "UK police resume intelligence sharing with US after receiving assurances", "Pakistan says Iranian mortar attack kills civilian", "South Korea questions six rescued North Koreans as it eyes engagement", "China's top diplomat wants peaceful resolution over North Korea", "Russia's Putin says certain Syria's Assad didn't use chemical weapons", "Oman mediating between Yemenis over U.N. peace plan: official"]}