{"breakingnews": ["Russia indicts St Petersburg blast suspect on terrorism charges: investigators", "U.S. citizens among 10 dead in southwest Mexico car crash", "Costa Rican plane crash kills 12, including 10 U.S. citizens", "Germany calls for calm in Iran, urges respect for right to protest", "Netanyahu wishes success to Iran protesters, denies Israeli involvement", "UK's Johnson calls for meaningful debate in Iran, respect for rights", "Turkey voices concern over Iran protests, calls for violence to be avoided", "U.S. puts Pakistan on notice: Do more to stop terrorism", "U.S. says air strike kills two militants in Somalia", "Erdogan says Turkey values Iranian stability, praises Rouhani", "Germany says Iranian protesters deserve respect", "Palestinians condemn Trump aid halt threat, mixed reaction in Israel", "Thieves steal sheikh's Indian jewels from display in Venice", "U.S. should clear way for tech companies to help Iranians: former crown prince", "Russia denies report that 7 planes destroyed in Syria attack - TASS", "Plane lifted from Sydney river after crash killed British CEO", "China believes Cambodia's election will be fair, confirms support", "Suspected Russian jets kill 30 near Damascus", "China says it welcomes efforts to improve ties on Korean peninsula", "Suspect in Kosovo organ trafficking case arrested in Cyprus", "Turkey, Germany agree on need for dialogue to improve ties: Turkish foreign minister", "France's U.N. ambassador says Iran protests not a threat to international peace", "Macedonia's PM hopes for a solution to dispute with Greece by June", "Netanyahu tiptoes around U.S. threat to cut off Palestinian aid", "Turkey says Syrian strikes in Idlib undermine political process", "U.S. probing if 'viral' attack sickened diplomats in Cuba: official", "German war graves unearthed at construction site in Estonia", "Tattoos lead Thai police to Japanese gang murder suspect", "Iranian cleric leaves Germany under threat of prosecution", "Facing U.S. extradition, bin Laden associate attacks French prison guards", "U.S. welcomes Libya's destruction of chemical weapons stockpile: statement", "Qatar says Emirati plane violated airspace, UAE denies", "Russia kills militants behind Syria air base attack: agencies", "Syrian state media says Turkey helped rebel attack", "Philippines arrests Chinese, Taiwanese nationals in telecoms fraud", "Egyptian fire kills Palestinian at sea: Gaza Health Ministry", "Congo launches offensive against Ugandan rebels in its east", "Hong Kong police arrest South Korean suspected of murdering wife, son at Ritz-Carlton", "Japan PM Abe honors 'Japanese Schindler' in Lithuania", "Britain has provided additional help to France on border security: PM May's spokesman", "Russia ready to support direct talks on North Korea crisis: Lavrov", "Four Pakistani soldiers killed in Indian fire across tense Kashmir frontier", "Denmark will increase defense spending to counter Russia: PM", "Palestinians see Gaza peace dividend pass them by", "Russia says North Korea summit undermines U.N., aggravates situation", "Uganda's Museveni accuses U.N. of \"preserving terrorism\" in eastern Congo", "Merkel optimistic Germany can work well with Austria on EU issues", "Kosovo to face harsh consequences if war crimes court scrapped: U.S.", "Taliban leader approved Islamabad meeting on Afghan peace talks: sources", "Israel's Netanyahu says Indian peace hero Gandhi an inspiration", "Russia rejects Trump allegation it violating U.N. sanctions on North Korea: Ifax", "Turkey detains five activists, including husband of freed German journalist: party", "Zimbabwe opposition leader Roy Bennett killed in U.S. helicopter crash", "Mexico should study Colombia peace process, says Obrador aide", "U.S. charges Honduran congressman with drug trafficking conspiracy", "Syrian Kurdish YPG says Turkish strikes kill 9", "Seoul says North Korea's Olympic participation will aid peace and ease tensions", "Six Ukrainians killed in attack in Kabul: Ukrainian minister", "France condemns Congolese security forces after six killed", "Abbas wins renewed EU backing for Palestinian capital in East Jerusalem", "Indonesia looks to U.S. to relax limits on its special forces", "Strikes kill 150 Islamic State militants in Syria: U.S.-led coalition", "U.S. stresses Lebanon must cut Hezbollah from financial system", "South Korea rejects 'Pyongyang Olympics' criticism", "Suspected U.S. drone kills two Haqqani network militants in Pakistan", "Mattis praises Vietnam's 'leadership' on North Korea sanctions", "Pakistan condemns U.S. drone strike inside its territory", "Four U.S. citizens killed in Jan. 20 attack on Kabul hotel", "Macedonia to rename airport to help resolve name row with Greece, PM says", "Israel's Netanyahu says only U.S. can broker peace deal", "Russia: military supplies to Myanmar are to strengthen defenses", "Moscow, markets ready for possible fresh U.S. sanctions", "Spanish tourists ambushed, raped in Senegal: military", "U.S.-backed SDF warns Turkey against widening attack", "U.N. Syria mediator to attend peace conference in Russia", "Don't ruin world with protectionism, Indonesia urges U.S.", "Turkey detains 300 people over criticism of Syrian offensive", "Delegates at Syria peace talks heckle Russian foreign minister", "Philippines files murder, kidnap charges against doctor linked to planned New York attacks", "Turkey orders detention of top doctors over criticism of Syrian offensive"]}