{"breakingnews": ["U.S. says Iran shows 'true colors' by restoring Hamas ties", "Car bomb kills four Libyan troops at checkpoint: security sources", "Tajikistan agrees to more intelligence exchanges with China", "Al Shabaab bomb kills 12 in Somalia's Puntland", "Australia, East Timor reach agreement on maritime border", "Iran says jailed U.S. student, dual nationals lose spying appeal", "Moon, Abe agree to pursue strong U.N. sanctions against North Korea: Blue House", "French foreign minister in Libya to push peace deal", "Venezuela's opposition-led congress seeks support in Paris", "China's Xi tells India's Modi to safeguard peace in border areas: media", "North Korea warns of 'more gift packages' for United States", "China says it will handle North Korea trade issues for benefit to peace, stability", "Putin rues awarding U.S. top diplomat Tillerson Russian state honor", "Lebanon to complain to U.N. over Israel violating airspace", "Spanish Red Cross physiotherapist killed in Afghanistan", "Militant blast, gun attack kill 18 police in Egypt's Sinai", "South Korea says North Korea must stop challenging peace, end nuclear program", "Britain unconditionally committed to maintaining European security: official document", "Germany's Merkel rejects total ban on arms exports to Turkey: NDR", "U.S. rejects Cambodian accusations, calls for opposition leader's release", "Rich tycoon takes on Iraqi Kurdish leaders over independence", "Fearing Russia, Sweden holds biggest war games in 20 years", "U.S. extends some Iran sanctions relief under nuclear deal", "Mexico accepts Israeli offer to help develop Central America", "British PM May outraged at North Korea's 'reckless provocation': spokesman", "Romanian soldier killed in Afghanistan convoy attack", "Car bomb kills one, wounds 10 in disputed Iraqi oil city", "Hamas says ready to hand Gaza to a Palestinian unity government", "China arrests Japanese citizen suspected of spying", "South African opposition to lay criminal complaint against McKinsey", "Russia rejects lawsuit to learn fate of Swedish war hero Wallenberg: agencies", "China says North Korea nuclear issue must be resolved peacefully", "Threats cannot help resolve Korean peninsula situation, China says", "Fire in Bangladesh textile factory kills six", "German court finds Syrian guilty over U.N. peacekeeper abduction", "Militant attack on minister's convoy kills two bystanders in India's Kashmir", "Union protests against French labor reform losing steam", "In South Korea, daily stresses outweigh North Korea missile worries", "Russia supports Iraq's territorial integrity: Lavrov", "Slovenian PM cancels Croatia visit over maritime dispute", "Saudi Arabia condemns Myanmar government 'policy of repression'", "Swedish court sentences Syrian asylum seeker to prison for posing with war dead", "U.S. hopes for 'good deliverables' during Trump's China visit", "British lesbian wins right to spousal visa in landmark Hong Kong case", "North Korea moving airplanes, boosting defense after U.S. bomber flight: Yonhap", "Iraqi soldiers join Turkish exercises near shared border: witness", "U.S. welcomes royal order to allow Saudi women to drive", "North Korea's bark may be worse than bite in threat to shoot down U.S. bombers", "France says Trump method not best way to tackle North Korea crisis", "Israel cuts jail term of soldier who killed prone Palestinian assailant", "NATO chief says Europe has interest in helping Afghanistan", "Rising tension spurs Malaysia to ban travel to North Korea", "France condemns Idlib offensive, urges Russia to abide by de-escalation deals", "U.S. student held in North Korea died of oxygen starved brain: coroner"]}