{"breakingnews": ["Lebanon will protect maritime borders from Israel: energy minister", "Congo: rebel leader detained in Tanzania, extradition sought", "Russia says interception of U.S. spy plane posed no danger", "Kurdish militant attacks near Iraq border kill three Turkish soldiers: army", "U.S. says 'deeply troubled' by reports of Myanmar mass graves", "Are you OK, Aunty May? China warms to UK Prime Minister", "France condemns killings in Cameroon, urges dialogue", "Migrant boat capsizes off Libya, 90 feared dead, mostly Pakistanis", "France says won't accept Syria circumventing chemical weapons' ban", "Mexico says would never support a violent solution to Venezuela crisis", "China accuses U.S. of disrespect after Latin America comments", "Sri Lanka eyeing longer talks with China on free trade agreement", "Syrian rebels down Russian plane, kill pilot", "Iraq plans military operation to secure oil route to Iran: security sources", "Israeli killed in Palestinian stabbing attack: Israeli officials", "U.S. blacklists four for rights abuses, attacks in Congo", "Paris attacks suspect declines to reappear at Brussels trial", "Tillerson praises Colombia aid to Venezuelans, anti-drug efforts", "Russia improving defenses at military bases in Syria: agencies", "Serbia must reach agreement with Kosovo to join EU by 2025", "More than 100 pro-Syrian forces killed after thwarted attack: U.S. official", "Afghans seeking justice pin hopes on Hague court investigation", "Tougher U.S. strategy brings Afghan gains, but peace or victory look remote", "Syria calls U.S.-led coalition strike in east Syria 'war crime'", "UK and Japanese firms agree on need for quickly agreeing post-Brexit free trade", "Mexico worried oil sanctions will hurt Venezuelans, Caribbean: minister", "U.S. dismisses fears of wider war after deadly Syria clashes", "Former British banker denied new trial in Hong Kong double murder case", "Kosovo detains two cyber crime suspects at U.S. request", "Colombia wants to build Venezuela financial rescue plan", "China's top diplomat tells Trump hopes to increase coordination on North Korea", "U.S. 'strongly supports' Israel's right to defend itself: State Department", "U.S. urges help for Iraq, extends $3 billion credit line", "China's U.S. envoy says 'dangerous to advocate confrontation'", "China angered as Indian PM visits disputed border region", "Lebanon tells U.S. committed to calm at southern border", "Taiwan president wishes China happy new year, gets warm response", "Kremlin says no new information on Russians killed in Syria", "Russian toll in Syria battle was 300 killed and wounded: sources", "Kosovo and Montenegro reach deal on 2015 border agreement", "Exclusive: Mexico foreign minister heads to Caribbean to win over Venezuelan allies - official", "Exclusive: For now, U.S. wants Europeans just to commit to improve Iran deal", "Turkey denies allegation of chemical attack in Syria", "Turkey says hopes to solve issues over Manbij via dialogue with U.S.", "Family of murdered Cambodian government critic arrive in Australia", "Malaysian woman charged with murder of Indonesian helper in latest case of abuse", "Russia rejects allegations pro-Assad forces behind Syria chlorine attack"]}