{"breakingnews": ["Suspected U.S. drone targets Haqqani militants in Pakistan, killing four", "China says resurfacing tensions on Korean peninsula regrettable", "Jordan sentences Syrian militant to death over border attack", "Finland suspects Russian aircraft violated airspace", "Iran denies U.S. accusation of destabilizing the region", "Bomb blast kills nine people in Pakistan, near Afghan border", "Turkey warns U.S. that Jerusalem embassy move is 'grave mistake'", "France says Syrian government obstructing peace talks", "Russia says ready for talks with U.S. to try to save arms pact", "Uber agrees to settle U.S. lawsuit filed by India rape victim", "Two dead in 'Day of Rage' over Jerusalem, Palestinian president defiant", "Israel defence minister says hopes Palestinian protests waning", "U.S. agency to help Iraq recover from IS despite Trump aid cuts", "Turkish air strikes kill 29 Kurdish militants in northern Iraq: army", "Two dead in Gaza blast, Israeli military denies it carried out an attack", "China says it welcomes all efforts to ease tension on Korean peninsula", "Palestine's Abbas says U.S. Jerusalem decision 'greatest crime'", "China warns Taiwan not to rely on foreigners after attack threat", "Swedish 'laser man' killer stands trial for murder in Germany", "Islamic State threatens U.S. attacks over Jerusalem decision: statement", "Putin says Poland should \"grow up\" and stop blaming Moscow for air crash", "Italian woman jailed in Denmark for ordering murder online in bitcoin", "Belgian trial of Paris attacker Abdeslam postponed: court", "Hoping to extend maritime reach, China lavishes aid on Pakistan town", "Belgian trial of Paris attack suspect postponed to Feb. 5", "Israel strikes Hamas targets in Gaza after Palestinian rocket attacks", "U.S. seeks ship ban over North Korea violations, Moon postponing drills", "Melania's birth country Slovenia sees strong tourism growth", "Germany condemns Houthi's firing missile at Saudi Arabia", "Serbian, Croatian police detain 17 for smuggling migrants to EU", "Germany hopes for improvement in Turkey ties after new prisoner release", "Fire in Philippine shopping mall kills 37", "'God bless you', Netanyahu tells Guatemalan president over Jerusalem embassy move", "Japan says revising comfort women agreement with South Korea unacceptable", "Brazil arrests alleged member of feared Mexican drug gang", "Chinese tourist killed, several injured in bus accident in Iceland", "Norway says made 'good progress' in China trade talks", "Taiwan president warns China against military aggression", "U.S. condemns arrest of peaceful protesters in Iran"]}