{"breakingnews": ["U.N. picks Norwegian for Myanmar role as tensions simmer over Rohingya crisis", "France's Macron accepts invite to visit Russia: RIA", "Tunnel collapse may have killed 200 after North Korea nuclear test: Japanese broadcaster", "German police arrest Syrian suspect, avert 'major terrorist attack'", "Seven killed as Israel destroys tunnel dug under Gaza border", "Syrian Kurds favor attending Russia-backed peace talks, party head says", "Germany issues arrest warrant against Syrian bomb plot suspect", "Syrian opposition rejects Russia-sponsored peace initiative", "Exclusive: U.S. pursues direct diplomacy with North Korea despite Trump rejection", "Russia's Putin says situation in Syria developing positively", "Supreme Leader Khamenei says U.S. is Iran's 'number one enemy'", "China says hopes U.S. can 'help, not cause problems' in South China Sea", "Israel's Netanyahu expresses hope for U.S. peace push in Middle East", "Israeli military says ready to protect Druze village in Syria", "Argentine survivor of New York attack pleads for justice, love", "Jumblatt: Lebanon too weak for Hariri resignation", "Hezbollah says Saudi Arabia forced Lebanon PM to resign", "Mattis backs Geneva process on Syrian conflict", "Bodies of Argentine men killed in New York attack returned", "Swiss man gets suspended prison term for spying in Germany", "Deep in Yemen war, Saudi fight against Iran falters", "Iranian political activist shot dead in Netherlands", "Despite NATO pledge to increase Afghan support, troop shortfall remains: U.S.", "Nigerian police kill one, arrest two suspects in British kidnapping", "Indonesia warns of tough response after Papuan rebels threaten Freeport", "France wants Hariri movements' free, able to play role in Lebanon", "German parties back NATO, want good ties with Russia: document", "Syria peace talks not yet scheduled: Russian foreign minister", "Egyptian forces destroy arms smugglers' vehicles on Libya border", "German war reparations 'matter of honor' for Poland", "Lebanon's Aoun says PM Hariri's freedom restricted in Riyadh", "Refugees in Greece demand transfer to Germany, start hunger strike", "Fears for Lebanese economy if Saudis impose Qatar-style blockade", "Sweden says Congo not helping investigation into murder of U.N. monitor", "China says 'friendly policy' toward Zimbabwe won't change", "Israeli army chief says ready to share information with Saudi Arabia", "China says 'dual suspension' proposal still best for North Korea", "Germany to spend 10 million euros to help clear mines in Syria: media", "U.S. envoy says no communication, no signal from North Korea amid nuclear crisis", "Hariri's Paris meeting to boost Lebanon stability: top aide", "Italy holds funeral for 26 Nigerian women drowned in Mediterranean", "China calls for peaceful Zimbabwe resolution under legal framework", "Israel president rejects pardon appeal of soldier who killed prone Palestinian assailant", "Lebanon's Hezbollah denies sending weapons to Yemen", "Lebanon's Hezbollah denies sending weapons to Yemen", "German coalition talks collapse is 'bad news for Europe': Dutch minister", "Russia's Putin hosts Assad in fresh drive for Syria peace deal", "U.S. marine accused of drunk driving after Japanese man dies in crash", "British PM May says Mugabe's resignation gives Zimbabwe a chance to be free", "Lebanon army chief warns of Israel threat amid political crisis", "Turkey charges three Bulgarians with migrant smuggling", "Russia says retreat of Syrian opposition figures good for peace", "China says hopes all parties can resolve North Korea issue peacefully", "Russia-hosted summit could be decisive for Syria peace: Erdogan", "Russia-hosted summit could be decisive for Syria peace: Erdogan", "Pakistan court orders release of Islamist blamed for Mumbai attacks", "U.S. backs Saudi 'first step' in addressing Yemen crisis", "Little prospect of Syria peace progress seen in Geneva talks", "Russia seeks two-day ceasefire in Damascus suburb; dozens killed by air strikes", "Britain's Prince Harry says thrilled at engagement to U.S. actress Markle", "Russia denies its planes killed civilians in Syria's Deir al-Zor: Ifax", "Trump, Japan's Abe agree to boost deterrence against North Korea: Japan government", "Croatian PM Plenkovic regrets Praljak's death in The Hague", "Greece charges nine over links to banned Turkish group"]}