{"breakingnews": ["Unclear if German embassy staff killed or hurt in Kabul blast: source", "French embassy in Kabul damaged in car bomb attack: minister", "Kabul blast hurts German embassy staff, kills guard: minister", "France says worried by Ukraine crisis, demands guarantees for observers", "Russian newspaper says received threat after reporting death in Syria", "Belgium arrests man in connection with Paris attacks", "Two French citizens injured in London attack: President's office", "Iran says London attacks 'wake up call', urges uprooting terrorism sources", "One Canadian national among those killed in London attack - PM Trudeau", "One French national died in London attack: foreign minister", "China says 31 nationals detained in Zambia for illegal mining", "France says two citizens missing since London attack", "U.S.-led coalition sees 'long and difficult' war for Syria's Raqqa", "U.S. military praises Qatar, despite Trump tweet", "Macron tells Abu Dhabi prince France will be uncompromising in fighting terrorism", "Two Australians confirmed dead in London attack: government", "Qatar condemns attacks in Iran: foreign ministry", "U.S. condemns attacks in Iran: State Dept.", "Head of U.S. missile defense says North Korea missile advances a 'great concern'", "Somalia's al Shabaab kills 20 soldiers in Puntland attack: officer", "Russia rebuffs Poland's criticism it mishandled 2010 air crash bodies", "U.S. concerned Iraqi Kurdish referendum will distract from war: State Department", "Turkey says Iraqi Kurdish independence vote a 'terrible mistake'", "Russia 'very helpful' in calming situation in southern Syria -Pentagon", "China offers support, help to Myanmar after plane crash", "Afghan policemen killed in U.S. airstrike: officials", "Qatar, accused of supporting terrorism, hires ex-U.S. attorney general", "Three U.S. soldiers killed in eastern Afghanistan attack: U.S. officials", "Britain, U.S. deny that Trump state visit delayed", "Afghan civilians killed as U.S. troops open fire after bomb attack: Afghan official", "Israel, Palestinians have failed to prosecute war crimes: U.N.", "Panama ex-president, accused of political espionage, arrested in Florida", "Turkey's Erdogan decries isolation of Qatar as 'inhumane', like a 'death penalty'", "Germany criticizes arrests of Russian demonstrators", "Turkish president says Qatar isolation violates Islamic values", "Turkish minister lands in Qatar aiming to help ease Gulf rift", "British Conservatives putting Irish peace at risk: Sturgeon", "Qatar says fighter jets deal shows deep U.S. support", "U.S. says has no information Baghdadi killed in Russian strike", "Russia's military says it may have killed IS leader; West, Iraq skeptical", "Germany threatens retaliation if U.S. sanctions harm its firms", "Three Palestinians shot dead after killing Israeli officer", "U.S. warns of new reports Congo troops killing, raping women, children", "Japan coast guard confirms seven missing after U.S. destroyer collides with container ship", "Americans lament Cuba becoming 'forbidden island' again", "U.S. urges bigger Chinese role to combat global terrorism", "Israeli troops shoot, kill Palestinian who tried to stab them: army", "France music festival goes on despite Brussels attack: spokesman", "Spain arrests 'highly radicalized' Moroccan with suicide bomb manual", "U.S. general condemns Islamic State's destruction of Mosul mosque", "Taliban say U.S. must quit Afghanistan for peace", "Colombia's ELN rebels free two Dutch journalists", "Syria says Israel strike kills civilians", "Iran's Rouhani backs Qatar, rejects 'siege'", "Irish naval ship rescues 712 people near Libya: defense forces", "Trump, India's Modi call on Pakistan to stem terrorist attacks", "U.S. to list China among worst human trafficking offenders: sources", "Germany urges all sides in Qatar crisis to talk, avoid escalation", "U.S. brands China as among worst human trafficking offenders", "U.S. says its warning appears to have averted Syrian chemical attack", "France urges China to free activist Liu, no comment if ready to welcome him", "Britain hopes Hong Kong makes more progress toward democracy", "Syria says U.S. chemical attack warning untrue, aims to justify new attack", "Venezuela's shield-bearing protesters inspired by Ukraine", "Moroccan national suspected of role in protests arrested in Netherlands", "U.N. approves drawdown of peacekeepers in Sudan's Darfur region"]}