{"breakingnews": ["Norway PM to visit China, meet President Xi after Nobel Peace Prize row", "Norway PM to visit China, meet President Xi after Nobel Peace Prize row", "North Korean murder suspects go home with victim's body as Malaysia forced to swap", "North Korean murder suspects go home with victim's body as Malaysia forced to swap", "Syria's warring sides trade insults after Geneva talks", "Syria's warring sides trade insults after Geneva talks", "Iran rejects U.S. terror claim by Mattis, blames Saudi", "Bolivia's Morales throat operation in Cuba a success: government", "Vietnamese died of stroke at Japanese detention center: official", "Russia says Poland's air crash accusations will harm ties: RIA", "Mexico condemns cancellation of OAS debate on Venezuela crisis", "Turkey says suspected gas attack in Syria a crime against humanity: Foreign minister", "Deadly Syria chemical attacks look like war crime: U.S. official", "Japan protests over 'extremely problematic' North Korea missile launch", "Trump blames Assad for deadly chemical attack in Syria, U.S. under pressure", "Turkey says findings indicate chemical weapons used in Syria attack", "Turkey gave Germany new dossier on suspected terrorists, sources say", "Iran condemns suspected chemical attack in Syria, offers help", "China denounces India hosting Dalai Lama in disputed region", "Russia says Obama 'red line' on Syria provoked attacks", "Spanish man found guilty of murdering U.S. woman on pilgrim route", "Abdullah welcomes Trump engagement in Israel-Palestinian peace", "American woman stabbed to death in Paris suburb: police", "U.S.-educated Islamic State propagandist killed in Syria", "France confident U.S. will not cut into Mali U.N. mission needs", "U.S. attack on Syrian base killed five, Homs governor says", "Syria says U.S. attack killed six, caused extensive damage", "U.S. attack killed nine civilians: Syrian state news agency", "Russian bases in Syria are protected by air defense missiles: RIA", "China and Norway resume free trade negotiations after diplomatic freeze", "U.S. prepared to do more in Syria, hopes not necessary: U.N. envoy", "India offers $5 billion credit line to Bangladesh for projects, defense", "Indian police arrest alleged kingpin of U.S. tax scam", "U.S. strikes destroyed Syrian means to deliver chemical weapons: admiral", "Abe praises Trump's security commitment after call on Syria, North Korea", "NATO official hopes Serbia-Kosovo tensions will ease after vote", "Mexican government condemns violence in Venezuela", "Islamic State launches two suicide attacks on U.S.-backed Syrian rebels", "India, China navies stop suspected Somali pirate attack on merchant vessel", "Pakistani court sentences accused Indian spy to death", "Serbia, United States step up efforts to bolster region's security", "China tops 2016 global executions, U.S. sees lowest number in decades", "Russia says two of its soldiers killed in Syria mortar attack - RIA", "White House accuses Russia of Syria chemical attack 'cover up'", "Five Sudanese soldiers killed in Yemen conflict", "A grimace and a shrug, but no fear of U.S. strike in Pyongyang", "Russia blocks U.N. Security Council condemnation of Syria attack", "U.S.-Russia relations at another low after Syria attacks", "Pence says U.S. commitment to South Korea stronger than ever", "Germany hopes Britain's early election leads to more Brexit clarity", "China seriously concerned by North Korean warnings on missile tests, nuclear war", "U.S. drone strike in Yemen kills four suspected al Qaeda members: local officials", "Russia denies media report it understated Syrian battle death toll", "U.S. troops still battling Islamic State near site of Afghan bomb strike", "Detained Hong Kong bookseller Gui wins Swedish free speech prize", "U.S. defense secretary looks to rebuild trust in Egypt visit", "Romania intends to buy Patriot missiles from U.S. to boost defenses", "Russian marine major killed in combat in Syria: agencies", "U.S. troubled by increasing extrajudicial killings in Philippines", "Kenyan forces say 52 al Shabaab fighters killed in Somalia", "U.S. forces kill Islamic State militant linked to Turkey nightclub attack", "Pence says United States will honor refugee deal with Australia", "Belgian paper cites pollster saying Macron wins French vote", "Bomb attack hits U.S. base in eastern Afghanistan", "Israel indicts U.S.-Israeli teen over bomb threats", "Sudan accuses South Sudan president of meeting rebels", "Spain arrests suspects with links to Belgian airport attack", "U.N., Russia warn against assault on main Yemeni port", "Turkey hopes for major defense export deal with Saudi Arabia: defense minister", "France awards family damages after police fail to stop daughter going to Syria", "China urges all sides to work towards peaceful solution on Korean Peninsula", "Turkey expresses sadness to Russian govt over ship collision", "All 78 crew rescued from Russian navy ship, in good health: Turkish minister", "Germany probes abuse of fatally injured Egyptian woman after car accident", "China foreign minister : peaceful agreement 'only' right choice on North Korea", "Lost Taiwan hiker says didn't give up hope in tragic 47-day Nepal ordeal", "U.S. renews Belarus sanctions relief", "Japan condemns North Korea missile launch, says it violates U.N. resolutions", "Japan's Abe says wants to resolve peace treaty issue with Russia"]}