{"breakingnews": ["France's Macron accepts invite to visit Russia: RIA", "German police arrest Syrian suspect, avert 'major terrorist attack'", "Germany issues arrest warrant against Syrian bomb plot suspect", "Exclusive: U.S. pursues direct diplomacy with North Korea despite Trump rejection", "China's Xi says hopes to promote relations with North Korea: KCNA", "Supreme Leader Khamenei says U.S. is Iran's 'number one enemy'", "Argentine survivor of New York attack pleads for justice, love", "Bangladesh police arrest militant suspected of killing U.S. blogger", "Taiwan hopes to find 'natural way' to engage with China's Xi at APEC", "Bodies of Argentine men killed in New York attack returned", "Britain says Iran's treatment of jailed aid worker is unacceptable", "Saudi Arabia says Lebanon declares war, deepening crisis", "Estonia arrests suspected Russian FSB agent", "Nazi victim memorial stones stolen in Berlin, police probe", "Malian soldiers killed in French strike had joined Islamists: source", "Swiss man gets suspended prison term for spying in Germany", "Hilltop tribe's bitterness a challenge for Libya peace effort", "Iranian political activist shot dead in Netherlands", "Nigerian police kill one, arrest two suspects in British kidnapping", "France wants Hariri movements' free, able to play role in Lebanon", "Hezbollah says Saudi declares Lebanon war with Hariri detention", "German parties back NATO, want good ties with Russia: document", "Egyptian forces destroy arms smugglers' vehicles on Libya border", "German war reparations 'matter of honor' for Poland", "Hariri's party condemns attacks against Saudi Arabia: statement", "Lebanon's Aoun says PM Hariri's freedom restricted in Riyadh", "U.S. launches media fund for Hungary to aid press freedom", "Macedonia's PM hopes for quick solution to name dispute with Greece", "Turkey and Russia agrees to focus on political solution in Syria", "Top U.S. negotiator arrives in South Korea amid hopes for easing tensions", "Refugees in Greece demand transfer to Germany, start hunger strike", "Fears for Lebanese economy if Saudis impose Qatar-style blockade", "Plane crash in Russia's far east kills six: report", "Israeli army chief says ready to share information with Saudi Arabia", "China says 'dual suspension' proposal still best for North Korea", "U.S. envoy says no communication, no signal from North Korea amid nuclear crisis", "Israel president rejects pardon appeal of soldier who killed prone Palestinian assailant", "China upset as Indian president visits disputed border region", "France wants 'strong and stable' Germany, President Macron says", "China says hopes all parties can resolve North Korea issue peacefully", "Germany detains six Syrian suspected of planning attack", "Russia says retreat of Syrian opposition figures good for peace", "Lebanon army chief warns of Israel threat amid political crisis", "U.S. marine accused of drunk driving after Japanese man dies in crash", "Italy's Berlusconi takes fight against ban from office to European court", "Putin wins backing from Iran, Turkey for new Syria peace push", "Pakistan court orders release of Islamist blamed for Mumbai attacks", "U.S. backs Saudi 'first step' in addressing Yemen crisis", "Fire in hotel on Georgia's Black Sea coast kills 11", "Britain's Prince Harry says thrilled at engagement to U.S. actress Markle", "Russia seeks two-day ceasefire in Damascus suburb; dozens killed by air strikes", "France pushes U.N. to impose sanctions over Libya migrant crisis", "Greece charges nine over links to banned Turkish group", "Nigeria flies migrants home from Libya after slavery scare"]}