{"breakingnews": ["Venezuela's Maduro celebrates new assembly, mocks U.S. criticism", "Defiant Venezuela president mocks Trump after U.S. sanctions", "Australian nurse jailed in Cambodia for running illegal surrogacy clinic", "Polish government condemns attack on Israeli football team", "Russia: Pence Balkans comments expose Washington's Cold War ideology", "Georgian soldier killed in Afghanistan convoy attack: coalition", "Dozens of fraud suspects repatriated to China from Fiji", "China calls on all sides to make positive efforts to resolve North Korea issue", "Turkey's Erdogan claims Germany abetting terrorists", "German helicopter lost rotors before Mali crash: report", "U.S. congresswoman confident Guam protected from North Korea threat", "Guam governor says North Korea's talk of revenge is no threat", "Tajikistan accuses Iran of involvement in 1990s civil war: TV documentary", "China urges calm over North Korea", "Canadian pastor freed by North Korea healthy, 'not in critical condition': family", "Young boy killed in car accident in Britain, prompting armed police response", "North Korea missile crisis seen pushing South Korea to gun up", "Swiss charge Ethiopian imam with inciting violence", "U.S. military denies air strike killed Afghan civilians", "Munich trade fair firm committed to Turkey despite blacklist: Welt", "Two U.S. service members killed, five injured in northern Iraq", "Turkey says one Turk killed, another wounded in Burkina Faso attack", "Between old foe and aggressive ally, no honeymoon for South Korea's Moon", "One French citizen killed in Burkina Faso attack: Foreign Ministry", "Suspected jihadists kill 18 in attack on Burkina Faso restaurant", "Japan to seek assurance of U.S. defense pledge, including nuclear deterrence", "Asian neighbors protest as Japan PM sends offering to war dead shrine", "Moscow hopes Iran won't quit nuclear deal", "China urges India to protect peace after border altercation", "U.S. service member killed in Afghanistan: military", "U.S. to honor Japan defense pact 'without reservation': Tillerson", "Iran denies appeal of jailed Princeton student: university", "No links at present between Barcelona attack suspects and France: minister", "Grenade attacks on bars in Burundi capital kill 3, wound 27", "Amid Spain attacks, Trump says U.S. ready and borders secure", "Eight French citizens seriously injured in Barcelona attack", "Top U.S. general reaffirms commitment to Japan amid N.Korea tensions", "One Canadian killed, four injured in Barcelona attack: Canada PM", "California man on delayed honeymoon among Barcelona victims", "Chinese scam suspects took over 11-story block in Cambodia", "Anger simmers in Philippines over Duterte's drug war", "China calls U.S. intellectual property probe 'irresponsible'", "'Extremely dissatisfied' China blames India for border scuffle", "Ukraine plant sucked into North Korea missile row has fallen on hard times", "Lebanon monitored Australia bomb plot suspects: minister", "Two arrested in Morocco over suspected links to Barcelona attackers: report", "Australia defends intelligence chief after Duterte photo", "U.S. holds powerful but risky tool to halt North Korea's nuclear progress", "U.S. journalist among 19 killed in South Sudan fighting: rebels", "Car bomb kills eight at Baghdad market: medics", "Russia's Lavrov: North Korea must respect U.N. resolutions", "Barcelona attackers' suspected supplier arrested in Morocco: source", "As Sudan seeks sanctions relief, U.S. presses religious freedom", "Police give all-clear after bomb threat at Canadian embassy in Berlin"]}