{"breakingnews": ["U.S. tourist arrested in Cambodia accused of killing masseuse", "Israeli-U.S. teen indicted for bomb threats, hate crimes: U.S. Justice Department", "China angered with U.S.-Taiwan travel bill, adding to tensions", "North Korea denies chemical weapons link with Syria: state media", "France's foreign minister says 'terrorist groups' likely behind Burkina attack", "Cambodia PM accuses United States of lying over aid cut", "White House accuses Russia of killing civilians in Syria", "Taiwan says China can't shirk responsibility in promoting positive cross-strait ties", "U.S. intelligence chief warns of China spending to boost influence", "Uzbekistan seeks bigger role in Afghan peace process", "Britain warns Russia over double agent's mysterious illness", "Russian military plane crash in Syria kills 39", "Poland says suspect arrested in 2016 was linked to Paris attacks", "Russian ex-spy, daughter still critical after suspected poisoning in UK", "With gas and diplomacy, Russia embraces Cold War foe Pakistan", "German cabinet approves increase in troops for Afghanistan", "U.N. criticizes Angola for forcing refugees to return to violent Congo", "U.S. destroyer McCain collision which killed 10 sailors caused by 'sudden turn': Singapore", "U.S. Holocaust museum rescinds award to Myanmar's Suu Kyi", "Afghanistan drone strike kills 20 Pakistani Taliban, officials say", "UNIFIL says 'no appetite' for war as Lebanon, Israel talk about border dispute", "China says detained Swedish bookseller rejected Swedish doctor visit", "Cambodia arrests 100 suspects over China telecoms fraud", "Iranian troops kill suicide attackers near Pakistan border: news agency", "Turkish socialite and friends killed in plane crash in Iran", "Russia: British threats to boycott World Cup over spy attack hurt ties, sport - Ifax", "Russia warns Britain against cyber attack response to spy poisoning", "France's Macron condemns nerve agent attack in Britain", "U.S. detecting Taliban interest in Afghan peace talks: Mattis", "Palestinian PM Hamdallah survives Gaza roadside bomb attack", "Only Russia could be behind U.K. poison attack: toxin's co-developer", "Finland is world's happiest country, U.S. discontent grows: U.N. report", "Russia says Britain chose confrontation over spy poisoning", "Migrant death in Italy points to dire conditions in Libya: aid workers", "Britain expels 23 Russian diplomats over nerve attack on ex-spy", "No 'bloody nose' plan for North Korea strike: U.S. commander", "Taiwan doles out incentives to retain talent as China lures investment", "U.S. helicopter crash in Iraq kills all aboard: military", "Sweden ready to help resolve tensions on Korean peninsula", "Sweden says happy to help on North Korea, amid summit speculation", "UK treating death of Russian businessman Glushkov as murder: police", "Russia to expel UK diplomats as crisis over nerve toxin attack deepens", "Mexico agrees to extradite former ruling party governor to U.S.", "Swedish foreign minister rejects 'unacceptable and unfounded' Russia toxin claim", "Russia expels 23 British diplomats as crisis over nerve toxin attack deepens", "No sign of forced entry in suspected murder of Russian businessman: UK police", "EU, UK reach broad agreement on transition, Irish issues: diplomat", "Saudi Arabia calls Iran nuclear deal a 'flawed agreement'", "Russia says regrets EU comments on UK spy attack", "London's Victoria rail station evacuated after fire alarm", "India confirms 39 Indians missing in Iraq since 2014 are dead", "Maduro challenger promises U.S. dollar giveaway for Venezuelans", "Expelled Russian diplomats leave Britain in nerve agent crisis", "U.S. ties 'super important' says Mexican leftist's pick to lead NAFTA talks", "Merkel strongly condemns Turkish military offensive in Afrin", "In Turkey's Kurdish heartland, anger over Syria war finds a stage", "Russia's foreign ministry says UK's Johnson poisoned with hatred", "Afghan migrant gets life sentence for raping, murdering German student", "Suspect in Palestinian assassination attempt among four dead in Gaza shootout: Hamas", "Venezuela socialists celebrate Peru leader's fall with fireworks", "EU backs Britain in blaming Russia for spy attack, recalls envoy"]}