{"breakingnews": ["Rohingya women, children die in desperate boat escape from Myanmar", "U.S. says Iran shows 'true colors' by restoring Hamas ties", "Tajikistan agrees to more intelligence exchanges with China", "Al Shabaab bomb kills 12 in Somalia's Puntland", "Australia, East Timor reach agreement on maritime border", "Iran says jailed U.S. student, dual nationals lose spying appeal", "Moon, Abe agree to pursue strong U.N. sanctions against North Korea: Blue House", "French foreign minister in Libya to push peace deal", "Venezuela's opposition-led congress seeks support in Paris", "China's Xi tells India's Modi to safeguard peace in border areas: media", "North Korea warns of 'more gift packages' for United States", "China says it will handle North Korea trade issues for benefit to peace, stability", "Putin rues awarding U.S. top diplomat Tillerson Russian state honor", "Lebanon to complain to U.N. over Israel violating airspace", "Spanish Red Cross physiotherapist killed in Afghanistan", "Militant blast, gun attack kill 18 police in Egypt's Sinai", "South Korea says North Korea must stop challenging peace, end nuclear program", "Britain unconditionally committed to maintaining European security: official document", "Germany's Merkel rejects total ban on arms exports to Turkey: NDR", "U.S. rejects Cambodian accusations, calls for opposition leader's release", "Rich tycoon takes on Iraqi Kurdish leaders over independence", "Fearing Russia, Sweden holds biggest war games in 20 years", "U.S. extends some Iran sanctions relief under nuclear deal", "Mexico accepts Israeli offer to help develop Central America", "British PM May outraged at North Korea's 'reckless provocation': spokesman", "Romanian soldier killed in Afghanistan convoy attack", "Hamas says ready to hand Gaza to a Palestinian unity government", "China arrests Japanese citizen suspected of spying", "Russia rejects lawsuit to learn fate of Swedish war hero Wallenberg: agencies", "China says North Korea nuclear issue must be resolved peacefully", "Threats cannot help resolve Korean peninsula situation, China says", "Fire in Bangladesh textile factory kills six", "German court finds Syrian guilty over U.N. peacekeeper abduction"]}