{"breakingnews": ["U.S. warns North Korean leadership will be 'utterly destroyed' in case of war", "Suspected U.S. drone targets Haqqani militants in Pakistan, killing four", "U.S. military says no civilians killed in August Somalia raid", "French defense minister hopeful for fighter jets, armored vehicle sale to Qatar", "At least 800 civilians killed by coalition strikes in Iraq, Syria: report", "Suspected Istanbul airport bomber thought killed in Georgia: three sources", "Israeli, Palestinian killed in two violent incidents", "Japan court sentences U.S. base worker to life for rape, murder: NHK", "Georgia says suspect in Istanbul airport bombing killed last week", "Suspected al Qaeda fighters among four Syrians arrested in Netherlands: prosecutors", "U.S. remains committed to Libyan political agreement: State Department", "Crime, casualties undermine U.S. gains on Afghan battlefield", "UAE denies Yemen's Houthis have fired missile toward UAE", "China says resurfacing tensions on Korean peninsula regrettable", "Jordan sentences Syrian militant to death over border attack", "Syrian walkout from talks 'an embarrassment to Russia': opposition", "Finland suspects Russian aircraft violated airspace", "In Brussels, Tillerson offers EU strong U.S. support", "Iran denies U.S. accusation of destabilizing the region", "Bomb blast kills nine people in Pakistan, near Afghan border", "North Korea boats off Japan spark spy scare; but some suspect just luckless fishermen", "France says Syrian government obstructing peace talks", "Russian air strikes kill 21 in eastern Syria: monitor", "Supporters free ex-Georgian leader Saakashvili from Ukrainian police amid chaotic scenes", "Qatar calls Trump's Jerusalem move 'death sentence for peace'", "Israel strikes Gaza militant posts after rockets fired at Israel: army", "Uber agrees to settle U.S. lawsuit filed by India rape victim", "UK to remain in sync after Brexit with EU rules supporting Irish peace", "Russia says ready for talks with U.S. to try to save arms pact", "Israel defence minister says hopes Palestinian protests waning", "Israel says it has destroyed Hamas attack tunnel from Gaza", "U.S. agency to help Iraq recover from IS despite Trump aid cuts", "Turkish air strikes kill 29 Kurdish militants in northern Iraq: army", "U.S. condemns threat to ban Venezuela opposition from elections", "Two dead in Gaza blast, Israeli military denies it carried out an attack", "Turkish teachers linked to Erdogan foe detained in Afghanistan", "China says it welcomes all efforts to ease tension on Korean peninsula", "Russia ready to consider easing arms embargo for Libya: Ifx cites diplomat", "China warns Taiwan not to rely on foreigners after attack threat", "Swedish 'laser man' killer stands trial for murder in Germany", "Islamic State threatens U.S. attacks over Jerusalem decision: statement", "Putin says Poland should \"grow up\" and stop blaming Moscow for air crash", "Italian woman jailed in Denmark for ordering murder online in bitcoin", "Belgian trial of Paris attacker Abdeslam postponed: court", "Despite failed round, U.N. Syria talks only viable peace effort, France says", "Hoping to extend maritime reach, China lavishes aid on Pakistan town", "Belgian trial of Paris attack suspect postponed to Feb. 5", "U.S. seeks ship ban over North Korea violations, Moon postponing drills", "Melania's birth country Slovenia sees strong tourism growth", "Germany condemns Houthi's firing missile at Saudi Arabia", "U.N. decries Israel's killing of Gaza amputee, Israel denies he was targeted", "Serbian, Croatian police detain 17 for smuggling migrants to EU", "Japan approves record defense spending that favors U.S.-made equipment", "PM Orban: Hungary will block any punitive EU action on Poland", "Germany hopes for improvement in Turkey ties after new prisoner release", "Ugandan army attacks rebel camps in eastern Congo", "'God bless you', Netanyahu tells Guatemalan president over Jerusalem embassy move", "Tunisia working with UAE on terrorist threat from female jihadist returnees", "Japan says revising comfort women agreement with South Korea unacceptable", "Brazil arrests alleged member of feared Mexican drug gang"]}