{"breakingnews": ["French prosecutor seeks jail, huge fine for Equatorial Guinea leader's son", "Turkey says it's not 'declaring war' in Syria, but ready to respond", "U.S. considering appointing envoy to Ukraine peace agreement: official", "War crimes court to rule on South Africa's failure to arrest Sudan's Bashir", "South Korea bomb shelters forgotten with no food, water as North Korea threat grows", "UK's Johnson arrives in Middle East to help ease Qatar tension", "Qatar rejects Arab states' accusations, UK's Johnson flies to Saudi", "UK defense minister welcomes Syria ceasefire, wants to see results", "UK's Johnson says progress can be made to ease Qatar tensions", "Ukraine's Poroshenko: Tillerson visit a powerful show of U.S. support", "U.S.'s Tillerson praises Turkish 'courage' during coup attempt", "Thailand approves $258-million purchase of South Korean fighter jets", "Berlin worries Trump's Russia problems hampering policy", "Israel backs Hungary, says financier Soros is a threat", "Sudan says it has fulfilled U.S. conditions for sanctions relief", "Iranian cancer researcher sent home after detained at Boston airport", "France calls on China to allow Liu Xiaobo's family to move around freely", "U.S. says it hopes Qatar, adversaries will agree to talk directly", "Palestinian President Abbas condemns Jerusalem holy site attack: WAFA", "Venezuela prosecutor urges U.S. detainee's conditional freedom", "Two tourists killed in Egypt resort knife attack were German: official", "Two German tourists stabbed to death on Egyptian beach", "Russia sees growing acceptance of Assad as key to Syria talks", "Cambodia arrests Chinese nationals suspected of telecoms extortion", "Dutch unveil memorial for victims of Ukraine airplane crash", "Iran's Revolutionary Guards warn U.S. against terrorist designation, new sanctions", "Denmark to train NATO soldiers to combat Russian misinformation", "Portuguese man pleads guilty to trying to help Iranian firm: Justice Dept.", "Germany condemns Turkish detention of activists, including German", "Gaza health care suffers as Palestinian factions play blame game", "Egypt's poorest risk death for promise of work in Libya", "Turkish ministry says Germany comments on activists' arrests unacceptable", "Taiwan says seven nationals detained in Cambodia for telecom fraud", "Shock in Egyptian knife attacker's home after Germans killed", "Qatar crisis strains Saudi-led Arab alliance in Yemen war", "Turkey minister accuses Berlin of harboring terrorists, as disagreement heats up", "Czech judges denounce Poland's legal overhaul as attack on freedom", "U.S. general says allies worry Russian war game may be 'Trojan horse'", "U.S. air strike kills Afghan forces in friendly-fire incident", "U.S. special envoy to visit eastern Ukraine", "Three Israelis stabbed to death in West Bank settlement", "Trump warns Iran over detained Americans: White House", "Russia ready to help mediate in Qatar row if asked: Lavrov", "Turkey's Erdogan says Israel will suffer most from Aqsa dispute", "Turkey working to resolve issues with Germany, hopes ties will improve, minister says", "Spanish policeman hurt, man with knife arrested on Morocco border", "Air strikes, shelling strain Moscow-backed Damascus truce", "Cuba rejects rumors it will mediate in Venezuela crisis", "Czech woman stabbed in Egypt attack on verge of death", "U.S. sanctions Venezuelan officials, one killed in anti-Maduro strike", "Czech woman stabbed in Egypt attack dies", "U.S. vows 'strong and swift' response to Venezuelan election"]}