{"breakingnews": ["Turkish police arrest suspect in killing of Syrian activist", "Syria's militant ex-Qaeda group denies leader injured in Russian strike", "Woman's murder prompts mass eviction of Syrians from Lebanese town", "U.S. condemns arrest of Istanbul consulate worker", "Russian riot police detain opposition protesters in St Petersburg: Reuters witness", "Turkey backs Syrian rebels for \"serious operation\" in Idlib", "Trump says giving peace a chance before U.S. embassy move to Jerusalem: interview", "Israel strikes Hamas post after Gaza rocket fire", "Militants attack checkpoint in Somalia's Puntland, seven dead", "Swiss woman abducted in Sudan by criminal gang for ransom: official", "Russia's Putin, eyeing election next year, pledges to prosecute vote violations", "Germany watching Trump's Iran decision with 'great concern'", "Moscow says escalation of tension on Korea peninsula unacceptable", "Taiwan president pledges to defend freedoms despite China pressure", "Vietnam calls on Cambodia to protect immigrants", "China complains after U.S. destroyer sails through South China Sea", "Turkey's Erdogan gets warm welcome in mainly Muslim Serbian town", "Turkish court remands German journalist in custody over terrorism charges", "Illinois man charged with kidnapping, death of Chinese scholar", "Cambodia deports 74 Chinese arrested for telecom extortion scams", "Turkey's Erdogan says U.S. consulate hiding suspect", "Chile welcomes more than 60 Syrian refugees", "Freeing of hostages in Pakistan a 'positive sign': U.S. general", "Russia says Trump's 'aggressive' stance on Iran doomed to fail", "Macron assures Iran's Rouhani of France's commitment to nuclear deal", "Four Moldovans killed in Ivory Coast plane crash: security minister", "Israeli minister says was misunderstood on war remarks with Iran", "Danger of war, Germany warns after Trump's move on Iran nuclear deal", "Bombs kill Pakistani soldiers hunting U.S.-Canadian family's kidnappers", "U.S. condemns Venezuelan elections as neither free nor fair", "Suspected U.S. drone strikes kill 31 on Pakistan-Afghanistan frontier", "Polish President Duda says hopes Turkey will join EU", "Israel: No peace talks with Palestinian government reliant on Hamas", "U.S. condemns killing of Malta journalist, says FBI assisting probe", "Hillary Clinton says U.S. threats of war with North Korea 'dangerous, short-sighted'", "Russia's Putin accuses U.S. of failing nuclear, chemical weapons treaties obligations", "Russia's Putin says defeat of terror in Syria imminent", "U.S. drone strike kills militant whose group killed 250 in Pakistan", "Putin says doubts U.S. strike on North Korea would destroy arsenal", "India says ready for stronger U.S. ties after Tillerson endorsement", "At least 46 attacks in area of Niger where U.S. troops killed: U.N.", "French defense minister: scrapping nuclear deal would be gift to Iran hardliners", "Widow of Russian major killed in Syria battles for compensation", "Factbox: U.S.-Pakistan ties falter as Afghanistan war drags on", "Politically charged murder trial of Mexican immigrant starts in San Francisco", "Wheelbarrow bomb kills man pushing it in Somalia’s Puntland, police say", "U.S. says 'administrative error' blocked Indonesia military chief's travel", "Turkey's Erdogan says ready to support Iraq reopening oil pipeline", "U.S., Gulf nations target Yemen terrorism financing", "U.S. judge rejects bid to dismiss Indonesian immigrant's lawsuit", "Qatar, Russia sign agreements on air defense, supplies", "China says defense ties inject 'positive energy' into U.S. relations", "U.S. service member killed in Afghanistan helicopter crash", "U.S. hopes for more from Russia after Crimean prisoners freed", "Japan pledges to help Philippines rebuild Marawi"]}