{"breakingnews": ["Venezuela's Maduro celebrates new assembly, mocks U.S. criticism", "Australian nurse jailed in Cambodia for running illegal surrogacy clinic", "Turkey promises to eliminate anti-China media reports", "Trump, frustrated by Afghan war, suggests firing U.S. commander: officials", "Polish government condemns attack on Israeli football team", "Russia: Pence Balkans comments expose Washington's Cold War ideology", "Georgian soldier killed in Afghanistan convoy attack: coalition", "Rwanda's Kagame wins third presidential term by a landslide", "Dozens of fraud suspects repatriated to China from Fiji", "China calls on all sides to make positive efforts to resolve North Korea issue", "Turkey's Erdogan claims Germany abetting terrorists", "Trump says North Korea will be met with 'fire and fury' if it threatens U.S.", "U.S.-led coalition strikes kill 29 civilians in Syria: monitor", "Bomb threat suspect in Israel offered services on dark web: U.S. authorities", "Diplomacy fails to defuse India, China border crisis: sources", "Guam governor says North Korea's talk of revenge is no threat", "China urges calm over North Korea", "Peru fears Venezuela headed toward civil war: foreign minister", "Canadian pastor freed by North Korea healthy, 'not in critical condition': family", "North Korea missile crisis seen pushing South Korea to gun up", "Swiss charge Ethiopian imam with inciting violence", "Cambodian PM accuses Laos of border violation, mobilizing troops", "U.S. military denies air strike killed Afghan civilians", "Peru expels Venezuelan ambassador to protest constituent assembly", "Munich trade fair firm committed to Turkey despite blacklist: Welt", "Peru condemns Venezuela force threat, preparing regional statement", "Two U.S. service members killed, five injured in northern Iraq", "Pence says 'failed state' in Venezuela threatens United States", "Japan to seek assurance of U.S. defense pledge, including nuclear deterrence", "U.S. confident of 'peaceable' Venezuelan solution: Pence", "China angered at U.S. criticism of religious freedom, says U.S. not perfect", "Turkey says Kurdish Iraq's referendum could worsen situation, lead to civil war", "Russia says Venezuela crisis must be resolved peacefully", "Moscow hopes Iran won't quit nuclear deal", "China urges India to protect peace after border altercation", "U.S. service member killed in Afghanistan: military", "Indians more amused than outraged by Chinese '7 Sins' video", "U.S. air strikes kill seven al Shabaab fighters in Somalia: U.S. military", "U.S. to honor Japan defense pact 'without reservation': Tillerson", "Trump condemns 'terror attack' in Barcelona, says U.S. ready to help", "No links at present between Barcelona attack suspects and France: minister", "Amid Spain attacks, Trump says U.S. ready and borders secure", "Eight French citizens seriously injured in Barcelona attack", "Top U.S. general reaffirms commitment to Japan amid N.Korea tensions", "One Canadian killed, four injured in Barcelona attack: Canada PM", "California man on delayed honeymoon among Barcelona victims", "Chinese scam suspects took over 11-story block in Cambodia", "British-Australian 7-year-old among dead in Barcelona attack", "China calls U.S. intellectual property probe 'irresponsible'", "'Extremely dissatisfied' China blames India for border scuffle", "Ukraine plant sucked into North Korea missile row has fallen on hard times", "Lebanon monitored Australia bomb plot suspects: minister", "UK academic publisher reposts blocked China articles after outcry", "After U.S. destroyer collision, Chinese paper says U.S. navy a hazard", "Britain welcomes Trump's renewed commitment to Afghanistan", "Moroccan who admitted killing two in Finland knife attack was refused asylum", "Two arrested in Morocco over suspected links to Barcelona attackers: report", "Exclusive: Trump's Afghan decision may increase U.S. air power, training", "Cambodia accuses U.S. of political interference, calls U.S. democracy 'bloody and brutal'", "Top U.S. general in Afghanistan says Trump's plan means long-term U.S. commitment", "U.S. holds powerful but risky tool to halt North Korea's nuclear progress", "UK PM May outraged by North Korean missile test 'reckless provocation'", "Barcelona attackers' suspected supplier arrested in Morocco: source", "As Sudan seeks sanctions relief, U.S. presses religious freedom", "Police give all-clear after bomb threat at Canadian embassy in Berlin", "Sore at Macron's 'dictatorship' criticism, Venezuela blasts France"]}