{"breakingnews": ["U.S. urges Myanmar security forces to protect civilians, aid workers", "U.S. says Iran shows 'true colors' by restoring Hamas ties", "Al Shabaab bomb kills 12 in Somalia's Puntland", "Australia, East Timor reach agreement on maritime border", "Iran says jailed U.S. student, dual nationals lose spying appeal", "French foreign minister in Libya to push peace deal", "Venezuela's opposition-led congress seeks support in Paris", "India's Modi heads to Myanmar as Rohingya refugee crisis worsens", "Indonesia ready to help Bangladesh in dealing with Rohingya refugees", "North Korea warns of 'more gift packages' for United States", "EU threatens Hungary, Poland with fines if refuse refugees", "Factbox: Humanitarian crisis worsens in Bangladesh as many Rohingya flee Myanmar", "U.S. forces apologize for 'highly offensive' Afghan propaganda leaflet", "China says it will handle North Korea trade issues for benefit to peace, stability", "U.S. Navy to transport damaged destroyer from Singapore to Japan", "Japan's Abe agrees with Putin North Korea nuclear test threatens peace", "Russia hopes to agree on debt repayment with Venezuela by year-end", "Venezuela has problems fulfilling obligations on debt: Russia", "UK publisher rejected request to block academic articles in China", "U.S. denies Iran report of confrontation with U.S. vessel", "Lebanon to complain to U.N. over Israel violating airspace", "Spanish Red Cross physiotherapist killed in Afghanistan", "U.S. calls on Myanmar to stop violence, displacement of Rohingya", "South Korea says North Korea must stop challenging peace, end nuclear program", "Germany's Merkel rejects total ban on arms exports to Turkey: NDR", "U.S. rejects Cambodian accusations, calls for opposition leader's release", "Lawyer assisting in murdered Italian student investigation detained in Egypt", "Bulgarian court sentences three Syrians on terrorism charges", "Myanmar faces 'defining moment', must stop the violence: U.S.", "U.S. extends some Iran sanctions relief under nuclear deal", "Mexico accepts Israeli offer to help develop Central America", "British PM May outraged at North Korea's 'reckless provocation': spokesman", "Romanian soldier killed in Afghanistan convoy attack", "Bangladesh warns Myanmar over border amid refugee crisis", "Hamas says ready to hand Gaza to a Palestinian unity government", "China arrests Japanese citizen suspected of spying", "Lawyer for detained Myanmar journalists denied access in Bangladesh", "Russia rejects lawsuit to learn fate of Swedish war hero Wallenberg: agencies", "China says North Korea nuclear issue must be resolved peacefully", "Threats cannot help resolve Korean peninsula situation, China says", "China offers support for strife-torn Venezuela at United Nations", "Austria checking indications nine foreigners abducted in Libya in 2015 are dead", "Trump says he is deeply disturbed by South Sudan, Congo violence", "German court finds Syrian guilty over U.N. peacekeeper abduction", "India presses on with Myanmar defense supplies in show of support", "Trump, Ghani agree U.S. can help develop Afghanistan's rare earth minerals", "In South Korea, daily stresses outweigh North Korea missile worries", "Zambia fears humanitarian crisis as influx of Congo refugees escalates", "Smaller EU states need stronger voice, not Brussels, says Czech election favorite", "Germany expels second Vietnamese diplomat over 'Cold War-style' abduction", "Russia supports Iraq's territorial integrity: Lavrov", "Despite tensions, U.S. sees value in New START treaty with Russia", "Saudi Arabia condemns Myanmar government 'policy of repression'", "U.S. air strikes kill 17 Islamic State militants in Libya: U.S. military", "Swedish court sentences Syrian asylum seeker to prison for posing with war dead", "U.S. hopes for 'good deliverables' during Trump's China visit", "British lesbian wins right to spousal visa in landmark Hong Kong case", "Austria's far right gives two cheers for German sister party's success", "North Korea moving airplanes, boosting defense after U.S. bomber flight: Yonhap", "Russia denies it killed civilians in air strikes on Syria's Idlib", "Iraqi soldiers join Turkish exercises near shared border: witness", "North Korea's bark may be worse than bite in threat to shoot down U.S. bombers", "France says Trump method not best way to tackle North Korea crisis", "Putin hails Russia's destruction of chemical weapons, accuses U.S.", "Israel cuts jail term of soldier who killed prone Palestinian assailant", "Rising tension spurs Malaysia to ban travel to North Korea", "France condemns Idlib offensive, urges Russia to abide by de-escalation deals", "U.S. student held in North Korea died of oxygen starved brain: coroner", "Congo naval boats battle rebels on Lake Tanganyika", "U.S. says countries should suspend providing weapons to Myanmar", "More than 60 Rohingya feared drowned as U.S. steps up pressure on Myanmar"]}