{"breakingnews": ["Lebanon will protect maritime borders from Israel: energy minister", "Russia says interception of U.S. spy plane posed no danger", "Suspected Balkan crime boss jailed for six years in Kosovo", "After Turkish anger, France's Macron plays down Syria warning", "U.S. says 'deeply troubled' by reports of Myanmar mass graves", "France condemns killings in Cameroon, urges dialogue", "Mexico says would never support a violent solution to Venezuela crisis", "China accuses U.S. of disrespect after Latin America comments", "Syrian rebels down Russian plane, kill pilot", "Iraq plans military operation to secure oil route to Iran: security sources", "Paris attacks suspect declines to reappear at Brussels trial", "Iran-backed Iraqi groups urge full U.S. withdrawal, hardliners threaten attacks", "Turkey says no disagreements with Russia over Syria operation", "Tillerson praises Colombia aid to Venezuelans, anti-drug efforts", "Fire in west London leaves one dead", "Tougher U.S. strategy brings Afghan gains, but peace or victory look remote", "Istanbul airport gains transit passenger share from Gulf", "Mexico worried oil sanctions will hurt Venezuelans, Caribbean: minister", "Former British banker denied new trial in Hong Kong double murder case", "Kosovo detains two cyber crime suspects at U.S. request", "China's top diplomat tells Trump hopes to increase coordination on North Korea", "U.S. 'strongly supports' Israel's right to defend itself: State Department", "Exclusive: U.S. IOC member suggests joint Korean team for Nobel Peace Prize", "Russia accuses United States of undermining Syria integrity: RIA", "U.S. urges help for Iraq, extends $3 billion credit line", "China's U.S. envoy says 'dangerous to advocate confrontation'", "China angered as Indian PM visits disputed border region", "U.S. defense chief says talks with Turkey on Syria 'open and honest'", "Lebanon tells U.S. committed to calm at southern border", "U.N. Security Council mulls Saudi praise for Yemen aid pledge", "Taiwan president wishes China happy new year, gets warm response", "'Sinister and systematic attack' by Russians prompts U.S. Congress calls for action", "Exclusive: For now, U.S. wants Europeans just to commit to improve Iran deal", "Family of murdered Cambodian government critic arrive in Australia", "U.S. sanctions Burkina Faso-based group over terrorism threat", "Mexico asks Rome for criminal background check on missing Italians", "Malaysian woman charged with murder of Indonesian helper in latest case of abuse", "Two French soldiers killed in Mali attack: Elysee", "Lebanon tribunal hears motion to dismiss charges against Hariri murder suspects", "Israeli military investigating Palestinian's death in West Bank confrontation", "Anger in Nigerian village as girls still missing after Boko Haram attack", "Congolese refugees killed in rations protest: Rwandan police", "Al Qaeda-linked group claims Mali attack that killed two French troops", "Key U.S. lawmakers want to boost Israel's $38 billion defense aid package", "U.S. says seeing 'positive indicators' from Pakistan on militants"]}