{"breakingnews": ["Four Indian police, two militants killed in Kashmir attack: police", "U.S. citizens among 10 dead in southwest Mexico car crash", "Germany calls for calm in Iran, urges respect for right to protest", "Netanyahu wishes success to Iran protesters, denies Israeli involvement", "Turkey voices concern over Iran protests, calls for violence to be avoided", "U.S. puts Pakistan on notice: Do more to stop terrorism", "U.S. says air strike kills two militants in Somalia", "Germany says Iranian protesters deserve respect", "Iran says arrests a European citizen in protests: Tasnim", "Thieves steal sheikh's Indian jewels from display in Venice", "Plane lifted from Sydney river after crash killed British CEO", "China believes Cambodia's election will be fair, confirms support", "Suspected Russian jets kill 30 near Damascus", "China says it welcomes efforts to improve ties on Korean peninsula", "Turkey, Germany agree on need for dialogue to improve ties: Turkish foreign minister", "France's U.N. ambassador says Iran protests not a threat to international peace", "Israel offers to pay African migrants to leave, threatens jail", "Macedonia's PM hopes for a solution to dispute with Greece by June", "Netanyahu tiptoes around U.S. threat to cut off Palestinian aid", "Suspected Bosnian Serb war criminal arrested in Munich", "U.S. probing if 'viral' attack sickened diplomats in Cuba: official", "German war graves unearthed at construction site in Estonia", "Iranian cleric leaves Germany under threat of prosecution", "Facing U.S. extradition, bin Laden associate attacks French prison guards", "China's Xi supports progress in inter-Korean talks: South Korea's Blue House", "France's Macron welcomes Merkel's deal with Social Democrats, says good for Europe", "Syrian state media says Turkey helped rebel attack", "Philippines arrests Chinese, Taiwanese nationals in telecoms fraud", "Japan PM Abe honors 'Japanese Schindler' in Lithuania", "Israel says it destroyed Gaza attack tunnel under Egyptian border", "Britain has provided additional help to France on border security: PM May's spokesman", "Russia ready to support direct talks on North Korea crisis: Lavrov", "Denmark will increase defense spending to counter Russia: PM", "Israel's Netanyahu says Indian peace hero Gandhi an inspiration", "Russia says North Korea summit undermines U.N., aggravates situation", "Russia rejects Trump allegation it violating U.N. sanctions on North Korea: Ifax"]}