{"breakingnews": ["Turkish police arrest suspect in killing of Syrian activist", "U.S. accuses Iran, Venezuela of human trafficking failings", "Somali refugee faces terror charges in Canada stabbing, car attacks", "Dutch defense minister resigns over peacekeepers' deaths in Mali", "U.S. expels 15 Cuban diplomats, fuelling tensions with Havana", "Scooter fire in western Paris triggers Jordan explosion scare", "Woman's murder prompts mass eviction of Syrians from Lebanese town", "U.S. condemns arrest of Istanbul consulate worker", "Pakistan's top diplomat pushes back on U.S. claims of militant support", "Russian riot police detain opposition protesters in St Petersburg: Reuters witness", "Trump says giving peace a chance before U.S. embassy move to Jerusalem: interview", "Militants attack checkpoint in Somalia's Puntland, seven dead", "Swiss woman abducted in Sudan by criminal gang for ransom: official", "Germany watching Trump's Iran decision with 'great concern'", "Moscow says escalation of tension on Korea peninsula unacceptable", "Taiwan president pledges to defend freedoms despite China pressure", "Vietnam calls on Cambodia to protect immigrants", "Macron determined to engage Germany in debate on Europe reforms", "Turkey's Erdogan blames U.S. envoy for diplomatic crisis", "Turkey's Erdogan gets warm welcome in mainly Muslim Serbian town", "Turkish court remands German journalist in custody over terrorism charges", "Illinois man charged with kidnapping, death of Chinese scholar", "Cambodia deports 74 Chinese arrested for telecom extortion scams", "Turkey's Erdogan says U.S. consulate hiding suspect", "Freeing of hostages in Pakistan a 'positive sign': U.S. general", "Saudi Arabia welcomes Hamas, Fatah reconciliation deal", "Russia says Trump's 'aggressive' stance on Iran doomed to fail", "Canadian says child killed, U.S. wife raped during Afghan kidnapping", "Israeli minister says was misunderstood on war remarks with Iran", "Danger of war, Germany warns after Trump's move on Iran nuclear deal", "Israel: No peace talks with Palestinian government reliant on Hamas", "U.S. condemns killing of Malta journalist, says FBI assisting probe", "U.S. will help restore water, power to Raqqa after fall of Islamic State", "Qatar suggests Gulf crisis hurts fight against Islamic State: CNBC", "Hillary Clinton says U.S. threats of war with North Korea 'dangerous, short-sighted'", "Fire destroys landmark hotel in Myanmar's largest city, kills one", "Young Japanese voters, happy with job market, lean toward ruling party", "Russia's Putin accuses U.S. of failing nuclear, chemical weapons treaties obligations", "U.S. drone strike kills militant whose group killed 250 in Pakistan", "Macedonian nationals arrested in Greece over wiretap scandal: police source", "Putin says doubts U.S. strike on North Korea would destroy arsenal", "Doubts about smoking gun as Duterte lauds China role in rebel killing", "India says ready for stronger U.S. ties after Tillerson endorsement", "At least 46 attacks in area of Niger where U.S. troops killed: U.N.", "French defense minister: scrapping nuclear deal would be gift to Iran hardliners", "U.S. condemns Russia veto of probe into Syria chemical weapons use", "U.S. says 'administrative error' blocked Indonesia military chief's travel", "Turkey's Erdogan says ready to support Iraq reopening oil pipeline", "U.S. judge rejects bid to dismiss Indonesian immigrant's lawsuit", "Qatar, Russia sign agreements on air defense, supplies", "China says defense ties inject 'positive energy' into U.S. relations", "U.S. service member killed in Afghanistan helicopter crash"]}